### ** GO_STP_6412 **

### ###   **SUYASH PRATAP SINGH**

# Task:1 Discuss the concept of One-Hot-Encoding, Multicollinearity and the Dummy Variable Trap.  What is Nominal and Ordinal Variables ?

#  Concept of Multicollinearity and Dummy Variable Trap
Multicollinearity:-It means value of one variable can be predicted from the values of other variable(s).It is a phenomenon in which two or more variables are highly correlated to each other. 

To check dummy variable trap scenario:-
Multiply the transpose of independent variable matrix(X’) with the independent variable matrix (X) and calculate the determinant.
1) If determinant of |X'* X| = 0 (dumpy variable trap scenario happen)
2) If determinant of |X'* X|!= 0 (dumpy variable trap scenario not happen)
To overcome the problem of multicollinearity, one of the dummy variables has to be dropped.

# Concept of One-Hot-Encoding
This method produces a vector with length equal to the number of categories in the data set. It is the process of creating dummy variables.The integer encoded variable is removed and a new binary variable is added for each unique integer value. Binary Variable often called "Dummy Variable".

In [ ]:
!pip install category_encoders

Collecting category_encoders
  Downloading https://files.pythonhosted.org/packages/44/57/fcef41c248701ee62e8325026b90c432adea35555cbc870aff9cfba23727/category_encoders-2.2.2-py2.py3-none-any.whl (80kB)
     |████████████████████████████████| 81kB 5.2MB/s
Requirement already satisfied: patsy>=0.5.1 in /usr/local/lib/python3.7/dist-packages (from category_encoders) (0.5.1)
Requirement already satisfied: scipy>=1.0.0 in /usr/local/lib/python3.7/dist-packages (from category_encoders) (1.4.1)
Requirement already satisfied: scikit-learn>=0.20.0 in /usr/local/lib/python3.7/dist-packages (from category_encoders) (0.22.2.post1)
Requirement already satisfied: statsmodels>=0.9.0 in /usr/local/lib/python3.7/dist-packages (from category_encoders) (0.10.2)
Requirement already satisfied: pandas>=0.21.1 in /usr/local/lib/python3.7/dist-packages (from category_encoders) (1.1.5)
Requirement already satisfied: numpy>=1.14.0 in /usr/local/lib/python3.7/dist-packages (from category_encoders) (1.19.5)
Requirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from patsy>=0.5.1->category_encoders) (1.15.0)
Requirement already satisfied: joblib>=0.11 in /usr/local/lib/python3.7/dist-packages (from scikit-learn>=0.20.0->category_encoders) (1.0.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas>=0.21.1->category_encoders) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas>=0.21.1->category_encoders) (2.8.1)
Installing collected packages: category-encoders
Successfully installed category-encoders-2.2.2

In [ ]:
#Implementation:-
import category_encoders as ce
import pandas as pd
teju=pd.DataFrame({'City':[
'Jaunpur','Mirzapur','Varansi','Lucknow','Kanpur','Jaunpur','Lucknow','Kanpur','Jaunpur'
]})

encoder=ce.OneHotEncoder(cols='City',handle_unknown='return_nan',return_df=True,use_cat_names=True)

teju

/usr/local/lib/python3.7/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

       City
0   Jaunpur
1  Mirzapur
2   Varansi
3   Lucknow
4    Kanpur
5   Jaunpur
6   Lucknow
7    Kanpur
8   Jaunpur

In [ ]:
data_encoded = encoder.fit_transform(teju)
data_encoded

/usr/local/lib/python3.7/dist-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):

   City_Jaunpur  City_Mirzapur  City_Varansi  City_Lucknow  City_Kanpur
0           1.0            0.0           0.0           0.0          0.0
1           0.0            1.0           0.0           0.0          0.0
2           0.0            0.0           1.0           0.0          0.0
3           0.0            0.0           0.0           1.0          0.0
4           0.0            0.0           0.0           0.0          1.0
5           1.0            0.0           0.0           0.0          0.0
6           0.0            0.0           0.0           1.0          0.0
7           0.0            0.0           0.0           0.0          1.0
8           1.0            0.0           0.0           0.0          0.0

#  What is Nominal and Ordinal Variables ?

Nominal Variable (Categorical):- Variable comprises a finite set of discrete values with no relationship between values.
For example: gender, Name, phone etc.
    
Ordinal Variable:- Variable comprises a finite set of discrete values with a ranked ordering between values.
For example: education level (“high school”,”BS”,”MS”,”PhD”) etc.

# Task:2 Salary Dataset of 52 professors having categorical columns. Apply dummy variables concept and one-hot-encoding on categorical columns.

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [ ]:
kp = pd.read_table(r'https://data.princeton.edu/wws509/datasets/salary.dat', delim_whitespace = True)
kp.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [ ]:
kp['sx'].unique()

array(['male', 'female'], dtype=object)

In [ ]:
du1 = pd.get_dummies(kp['sx'], drop_first=True)
du1.head()

   male
0     1
1     1
2     1
3     0
4     1

In [ ]:
#cancatenate(merge)
df1 = pd.concat([kp, du1], axis=1).drop('sx', axis=1)
df1.head()

     rk  yr         dg  yd     sl  male
0  full  25  doctorate  35  36350     1
1  full  13  doctorate  22  35350     1
2  full  10  doctorate  23  28200     1
3  full   7  doctorate  27  26775     0
4  full  19    masters  30  33696     1

In [ ]:
kp['rk'].unique()

array(['full', 'associate', 'assistant'], dtype=object)

In [ ]:
du2 = pd.get_dummies(kp['rk'])
du2.head()

   assistant  associate  full
0          0          0     1
1          0          0     1
2          0          0     1
3          0          0     1
4          0          0     1

In [ ]:
df2 = pd.concat([kp, du2], axis=1).drop('rk', axis=1)
df2.head()

       sx  yr         dg  yd     sl  assistant  associate  full
0    male  25  doctorate  35  36350          0          0     1
1    male  13  doctorate  22  35350          0          0     1
2    male  10  doctorate  23  28200          0          0     1
3  female   7  doctorate  27  26775          0          0     1
4    male  19    masters  30  33696          0          0     1

In [ ]:
kp['dg'].unique()

array(['doctorate', 'masters'], dtype=object)

In [ ]:
du3 = pd.get_dummies(kp['dg'])
du3.head()

   doctorate  masters
0          1        0
1          1        0
2          1        0
3          1        0
4          0        1

In [ ]:
du3 = du3.drop('masters', axis=1)  #more simplification
du3.head()

   doctorate
0          1
1          1
2          1
3          1
4          0

In [ ]:
df3 = pd.concat([kp, du3], axis=1).drop('dg', axis=1)
df3.head()

       sx    rk  yr  yd     sl  doctorate
0    male  full  25  35  36350          1
1    male  full  13  22  35350          1
2    male  full  10  23  28200          1
3  female  full   7  27  26775          1
4    male  full  19  30  33696          0

# One hot encoding

In [ ]:
from sklearn.preprocessing import LabelEncoder
Le = LabelEncoder()

In [ ]:
newdf = kp
newdf.sx = Le.fit_transform(newdf.sx)
newdf.head()

   sx    rk  yr         dg  yd     sl
0   1  full  25  doctorate  35  36350
1   1  full  13  doctorate  22  35350
2   1  full  10  doctorate  23  28200
3   0  full   7  doctorate  27  26775
4   1  full  19    masters  30  33696

In [ ]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

In [ ]:
ct = ColumnTransformer([('sx',OneHotEncoder(),[0])])

In [ ]:
newct= ct.fit_transform(kp)
newct

array([[0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.]])

In [ ]:
from sklearn.preprocessing import LabelEncoder
Le = LabelEncoder()

In [ ]:
newdf = kp
newdf.rk = Le.fit_transform(newdf.rk)
newdf.head()

   sx  rk  yr         dg  yd     sl
0   1   2  25  doctorate  35  36350
1   1   2  13  doctorate  22  35350
2   1   2  10  doctorate  23  28200
3   0   2   7  doctorate  27  26775
4   1   2  19    masters  30  33696

In [ ]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

In [ ]:
ct = ColumnTransformer([('rk',OneHotEncoder(),[1])])

In [ ]:
newct= ct.fit_transform(kp)
newct

array([[0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 1., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 1., 0.],
       [0., 1., 0.],
       [0., 1., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.]])

In [ ]:
pd.get_dummies(kp,columns = ['sx','rk','dg'],drop_first=True).head()

   yr  yd     sl  sx_1  rk_1  rk_2  dg_masters
0  25  35  36350     1     0     1           0
1  13  22  35350     1     0     1           0
2  10  23  28200     1     0     1           0
3   7  27  26775     0     0     1           0
4  19  30  33696     1     0     1           1

In [ ]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

In [ ]:
ct = ColumnTransformer([('encoder',OneHotEncoder(),[0,1,3])],remainder='passthrough')

In [ ]:
tejas = np.array(ct.fit_transform(kp),dtype= str)
print(tejas[:5])

[['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '25.0' '35.0' '36350.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '13.0' '22.0' '35350.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '10.0' '23.0' '28200.0']
 ['1.0' '0.0' '0.0' '0.0' '1.0' '1.0' '0.0' '7.0' '27.0' '26775.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '0.0' '1.0' '19.0' '30.0' '33696.0']]

# THANK YOU